type CategoryType = {
  category: string;
  main: {
    main: string;
    sub: {
      mid: string;
      detail: string[];
    }[];
  }[];
};

export const category: CategoryType[] = [
  {
    category: "spots",
    main: [
      {
        main: "자연",
        sub: [
          {
            mid: "자연관광지",
            detail: [
              "국립공원",
              "도립공원",
              "군립공원",
              "산",
              "자연생태관광지",
              "자연휴양림",
              "수목원",
              "폭포",
              "계곡",
              "약수터",
              "해안절경",
              "해수욕장",
              "섬",
              "항구/포구",
              "등대",
              "호수",
              "강",
              "동굴",
            ],
          },
          {
            mid: "관광자원",
            detail: ["희귀동.식물", "기암괴석"],
          },
        ],
      },
      {
        main: "인문(문화/예술/역사)",
        sub: [
          {
            mid: "역사관광지",
            detail: [
              "고궁",
              "성",
              "문",
              "고택",
              "생가",
              "민속마을",
              "유적지/사적지",
              "사찰",
              "종교성지",
              "안보관광",
              "취소확인",
            ],
          },
          {
            mid: "휴양관광지",
            detail: [
              "관광단지",
              "온천/욕장/스파",
              "이색찜질방",
              "헬스투어",
              "테마공원",
              "공원",
              "유람선/잠수함관광",
            ],
          },
          {
            mid: "체험관광지",
            detail: [
              "농.산.어촌 체험",
              "전통체험",
              "산사체험",
              "이색체험",
              "이색거리",
            ],
          },
          {
            mid: "산업관광지",
            detail: ["발전소", "식음료", "기타", "전자-반도체", "자동차"],
          },
          {
            mid: "건축/조형물",
            detail: [
              "다리/대교",
              "기념탑/기념비/전망대",
              "분수",
              "동상",
              "터널",
              "유명건물",
            ],
          },
        ],
      },
    ],
  },
  {
    category: "facilities",
    main: [
      {
        main: "인문(문화/예술/역사)",
        sub: [
          {
            mid: "문화시설",
            detail: [
              "박물관",
              "기념관",
              "전시관",
              "컨벤션센터",
              "미술관/화랑",
              "공연장",
              "문화원",
              "외국문화원",
              "도서관",
              "대형서점",
              "문화전수시설",
              "영화관",
              "어학당",
              "학교",
            ],
          },
        ],
      },
    ],
  },
  {
    category: "festivals",
    main: [
      {
        main: "인문(문화/예술/역사)",
        sub: [
          {
            mid: "축제",
            detail: ["문화관광축제", "일반축제"],
          },
          {
            mid: "공연/행사",
            detail: [
              "전통공연",
              "연극",
              "뮤지컬",
              "오페라",
              "전시회",
              "박람회",
              "무용",
              "클래식음악회",
              "대중콘서트",
              "영화",
              "스포츠경기",
              "기타행사",
              "넌버벌",
              "취소확인",
            ],
          },
        ],
      },
    ],
  },
  {
    category: "courses",
    main: [
      {
        main: "추천코스",
        sub: [
          {
            mid: "가족코스",
            detail: ["가족코스"],
          },
          {
            mid: "나홀로코스",
            detail: ["나홀로코스"],
          },
          {
            mid: "힐링코스",
            detail: ["힐링코스"],
          },
          {
            mid: "도보코스",
            detail: ["도보코스"],
          },
          {
            mid: "캠핑코스",
            detail: ["캠핑코스"],
          },
          {
            mid: "맛코스",
            detail: ["맛코스"],
          },
        ],
      },
    ],
  },
];
